/* Compound */
"%[Any]@ of the following are true" = "满足以下%[任一]@条件";
"%[All]@ of the following are true" = "满足以下%[全部]@条件";
"%[None]@ of the following are true" = "满足以下%[无]@条件";

/* Name, path, relative path, extension */
"%[name]@ %[is]@ %@" = "%1$[文件名称]@ %2$[是]@ %3$@";
"%[path]@ %[is]@ %@" = "%1$[文件路径]@ %2$[是]@ %3$@";
"%[relativePath]@ %[is]@ %@" = "%1$[相对文件路径]@ %2$[是]@ %3$@";
"%[extension]@ %[is]@ %@" = "%1$[文件扩展名]@ %2$[是]@ %3$@";

"%[name]@ %[is not]@ %@" = "%1$[文件名称]@ %2$[不是]@ %3$@";
"%[path]@ %[is not]@ %@" = "%1$[文件路径]@ %2$[不是]@ %3$@";
"%[relativePath]@ %[is not]@ %@" = "%1$[相对文件路径]@ %2$[不是]@ %3$@";
"%[extension]@ %[is not]@ %@" = "%1$[文件扩展名]@ %2$[不是]@ %3$@";

"%[name]@ %[contains]@ %@" = "%1$[文件名称]@ %2$[包含]@ %3$@";
"%[path]@ %[contains]@ %@" = "%1$[文件路径]@ %2$[包含]@ %3$@";
"%[relativePath]@ %[contains]@ %@" = "%1$[相对文件路径]@ %2$[包含]@ %3$@";
"%[extension]@ %[contains]@ %@" = "%1$[File extension]@ %2$[contains]@ %3$@";

"%[name]@ %[begins with]@ %@" = "%1$[文件名称]@ %2$[开头是]@ %3$@";
"%[path]@ %[begins with]@ %@" = "%1$[文件路径]@ %2$[开头是]@ %3$@";
"%[relativePath]@ %[begins with]@ %@" = "%1$[相对文件路径]@ %2$[开头是]@ %3$@";
"%[extension]@ %[begins with]@ %@" = "%1$[File extension]@ %2$[begins with]@ %3$@";

"%[name]@ %[ends with]@ %@" = "%1$[文件名称]@ %2$[结尾是]@ %3$@";
"%[path]@ %[ends with]@ %@" = "%1$[文件路径]@ %2$[结尾是]@ %3$@";
"%[relativePath]@ %[ends with]@ %@" = "%1$[相对文件路径]@ %2$[结尾是]@ %3$@";
"%[extension]@ %[ends with]@ %@" = "%1$[File extension]@ %2$[ends with]@ %3$@";

"%[name]@ %[matches]@ %@" = "%1$[文件名称]@ %2$[匹配常规表达式]@ %3$@";
"%[path]@ %[matches]@ %@" = "%1$[文件路径]@ %2$[匹配常规表达式]@ %3$@";
"%[relativePath]@ %[matches]@ %@" = "%1$[相对文件路径]@ %2$[匹配常规表达式]@ %3$@";
"%[extension]@ %[matches]@ %@" = "%1$[File extension]@ %2$[matches regular expression]@ %3$@";

/* Open document */
"%[open]@ %[is]@ %[0]@" = "%1$[文稿状态]@ %2$[是]@ %3$[未打开]@";
"%[open]@ %[is]@ %[1]@" = "%1$[文稿状态]@ %2$[是]@ %3$[打开]@";

/* SCM status */
"%[hasSourceControlChanges]@ %[is]@ %[0]@" = "%1$[源控制状态]@ %2$[是]@ %3$[未更改]@";
"%[hasSourceControlChanges]@ %[is]@ %[1]@" = "%1$[源控制状态]@ %2$[是]@ %3$[已更改]@";

